from datetime import datetime


s1 = datetime.now()

a = 10 ** 1000000
print(datetime.now() - s1)

s2 = datetime.now()
b = pow(10, 1000000)
print(datetime.now() - s2)

# 테스트 결과 낮은 수일 경우에는 유의미한 차이가 있으나, 지수가 커질수록 오차범위 내로 좁혀짐
# 그런데 백준은 pow는 되고 **은 안됨 심지어 python으로 구현한 재귀는 C로 구현한 재귀랑 동일한 로직이어도 안됨
# 0:00:00.000006
# 0:00:00.000002

# 0:00:00.000007
# 0:00:00.000002

# 0:00:00.000007
# 0:00:00.000088

# 0:00:00.000084
# 0:00:00.000084

# 0:00:00.105809
# 0:00:00.104669

# 0:00:00.109724
# 0:00:00.111063

# 0:00:00.106786
# 0:00:00.105794

# 0:00:00.104752
# 0:00:00.105379